{"info": {"gameMode": "normal", "name": "First I wanna say that while this is very tragic, I understand the developers' reasons for taking Sphere down. If the devs decide that three servers need to be taken down, then so be it; it's their game. Curve and Segment obviously are the first two to go, as no one ever uses them. I also don't hold any ill will towards LuckySpammer for choosing Sphere as the third server to go. It is a known fact that it has the smallest regular player base out of all of the five major American servers. It only makes sense from a purely logical perspective to therefore eliminate this server, as the least number of people will be directly affected. The smaller community size has directly had an impact on the Sphere community's strength. As new players had trickled in more slowly on Sphere, it allowed us to more easily recognize them and thus transform them in our own perspectives from strangers to good friends. I've been playing TagPro for about 21 months now, and many times, I've sought out to recognize the unique game community that we have here in TagPro (in fact, the community is why I became an in-game moderator; it is my way to give my appreciation and ensure that the community continues to progress forward in such a positive direction). All of my experiences on Sphere, especially the first few in July of 2014, played a completely integral role in helping me realize how special our community is. Sphere's player base was particularly commendable in both its inclusiveness, through its welcoming and approachable demeanor, and its patience, through its desire to teach instead of rage. If others have had negative memory on Sphere, I pity them, because they haven't been able to experience the wonderful things I have with Sphere. It has tremendously helped me grow and develop both as a player and as a person. My heart also grieves for the competitive players in Centra. Sphere got to host cross-national matches, including the Super/Muper/Nuper/Booper Balls. With the elimination of Sphere, teams from opposing sides of the country will need to meet on Origin, currently based in Detroit. Consequently, Pacific based teams will be placed at a disadvantage, as they will be forced to connect three fourths across the continent in order to play another team. I hope that, for their sake, the developers will be able to find a solution to this issue, perhaps through relocation of one of the servers. As the days of Sphere come to an end, it will be painful for me to see so many of my friends go off to different servers. But though my heart is burdened with great sorrow, I also hold a ray of hope that some day we'll be able to play with each other once again. Sphere's community has progressed to the point where we view each other as family, and I trust that when the opportunity comes, we all will reunite with each other and gather to celebrate a great banquet of love and joy.", "author": "Why am being take release Tagpro Next so long?"}, "portals": {}, "fields": {"15,23": {"defaultState": "off"}, "17,23": {"defaultState": "off"}, "17,22": {"defaultState": "off"}, "17,25": {"defaultState": "off"}, "17,24": {"defaultState": "off"}, "18,23": {"defaultState": "off"}, "18,26": {"defaultState": "off"}, "27,10": {"defaultState": "off"}, "18,24": {"defaultState": "off"}, "18,25": {"defaultState": "off"}, "19,25": {"defaultState": "off"}, "19,24": {"defaultState": "off"}, "19,26": {"defaultState": "off"}, "16,24": {"defaultState": "off"}, "29,12": {"defaultState": "off"}, "29,11": {"defaultState": "off"}, "29,10": {"defaultState": "off"}, "16,22": {"defaultState": "off"}, "16,23": {"defaultState": "off"}, "20,25": {"defaultState": "off"}, "28,8": {"defaultState": "off"}, "28,9": {"defaultState": "off"}, "27,9": {"defaultState": "off"}, "27,8": {"defaultState": "off"}, "31,11": {"defaultState": "off"}, "26,9": {"defaultState": "off"}, "29,9": {"defaultState": "off"}, "30,11": {"defaultState": "off"}, "28,10": {"defaultState": "off"}, "30,12": {"defaultState": "off"}, "28,11": {"defaultState": "off"}, "30,10": {"defaultState": "off"}}, "switches": {"34,9": {"toggle": [{"pos": {"y": 9, "x": 26}}, {"pos": {"y": 8, "x": 27}}, {"pos": {"y": 9, "x": 27}}, {"pos": {"y": 10, "x": 27}}, {"pos": {"y": 8, "x": 28}}, {"pos": {"y": 9, "x": 28}}, {"pos": {"y": 10, "x": 28}}, {"pos": {"y": 11, "x": 28}}, {"pos": {"y": 9, "x": 29}}, {"pos": {"y": 10, "x": 29}}, {"pos": {"y": 11, "x": 29}}, {"pos": {"y": 12, "x": 29}}, {"pos": {"y": 10, "x": 30}}, {"pos": {"y": 11, "x": 30}}, {"pos": {"y": 12, "x": 30}}, {"pos": {"y": 11, "x": 31}}], "timer": 0}, "12,25": {"toggle": [{"pos": {"y": 23, "x": 15}}, {"pos": {"y": 22, "x": 16}}, {"pos": {"y": 23, "x": 16}}, {"pos": {"y": 24, "x": 16}}, {"pos": {"y": 22, "x": 17}}, {"pos": {"y": 23, "x": 17}}, {"pos": {"y": 24, "x": 17}}, {"pos": {"y": 25, "x": 17}}, {"pos": {"y": 23, "x": 18}}, {"pos": {"y": 24, "x": 18}}, {"pos": {"y": 25, "x": 18}}, {"pos": {"y": 26, "x": 18}}, {"pos": {"y": 24, "x": 19}}, {"pos": {"y": 25, "x": 19}}, {"pos": {"y": 26, "x": 19}}, {"pos": {"y": 25, "x": 20}}], "timer": 0}}, "marsballs": [], "spawnPoints": {"blue": [], "red": []}}