{"info": {"gameMode": "normal", "name": "I'm in love with an anime character I need help. It's not a joke first of all...I know it sounds fucking pathetic and gross. I'm a 19 y/o male I've only been in a single relationship for some context. There's this anime character that I fell in love with. Everyday when I wake up I feel like there's a lump in my throat and my chest hurts so much knowing she's not real. I cry nearly everyday thinking about how she's not real I feel incredibly sad all the time. I try to force myself to take sleeping pills and to go to sleep so I'll have dreams about her and it's been destroying my relationships with my friends and my parents since I'm sleeping most of the time. I'm taking a summer class and I haven't been handing anything in since I'm in bed all day. It hurts so much thinking about her. I know I have a problem but I don't know who to talk to it about. No one will understand me. I used to take care of my body I was in good shape but now I can't find the motivation to eat, go to the gym, or take care of my hygiene. I just can't stop crying. I want the pain to stop.", "author": "denki"}, "portals": {"16,24": {"cooldown": 0, "destination": {"y": 17, "x": 20}}, "17,23": {"cooldown": 0, "destination": {"y": 17, "x": 20}}, "32,6": {"cooldown": 0, "destination": {"y": 13, "x": 28}}, "40,28": {}, "35,21": {"cooldown": 1000, "destination": {"y": 27, "x": 41}}, "7,3": {}, "41,27": {}, "35,25": {"cooldown": 1000, "destination": {"y": 28, "x": 40}}, "9,9": {"cooldown": 1000, "destination": {"y": 4, "x": 6}}, "8,2": {}, "42,26": {}, "20,17": {}, "13,5": {"cooldown": 1000, "destination": {"y": 2, "x": 8}}, "39,21": {"cooldown": 1000, "destination": {"y": 26, "x": 42}}, "13,9": {"cooldown": 1000, "destination": {"y": 3, "x": 7}}, "31,7": {"cooldown": 0, "destination": {"y": 13, "x": 28}}, "6,4": {}, "28,13": {}}, "fields": {}, "switches": {}, "marsballs": [], "spawnPoints": {"blue": [{"y": 22, "x": 36, "radius": 5, "weight": 1}], "red": [{"y": 8, "x": 12, "radius": 5, "weight": 1}]}}