{"info": {"gameMode": "normal", "name": "Okay, so here's how you make a cat girl. Don't genetically modify a girl for cat like features. We can't do that yet. Selectively breed humans to give you a young girl with anime like features, and raise her in isolation so she trusts you and only you. Make her think animes are examples of how people really behave. Formulate a strict diet and exercise plan so she's always in the exact physical form you wish. Humans have a \"growth hormone\". Excess of this causes giganticism. I'm absolutely sure cats have a similar hormone, which scientists are probably already aware of. If not, finding it should be doable. Not easy, science is never easy, but doable with current technology. Find the breed of cat with ears and tail that best matches your aesthetic preferences, and fur the colour you want. Take young, healthy, robust specimens and inject the growth hormone directly into their circulatory system, in a large vein, not an extremity. Scale the dosage down, based on mass ratios, from what is effective on humans (this information is known to scientists, and can be accessed on journals. You'd have to pay for it, but that's a small price for salvation). Some cats will die. Adjust your dosage, and figure out a way to keep them alive. (Exercise and diet will be manipulated. Upon scaling the animal up, there will be issues. Maybe the circulatory system can't cope; if so, use steroid injections to strengthen the muscle. If the bones aren't keeping pace, add metal plates as extensions like we already do for humans in some surgeries. You get the idea. Fix the fucking problems) Once you have the right dosage and treatment, genetically alter the cat to remove as many non-human markers from the cells as you can. Not easy, you won't get them all, but what can you do. Breed a cat altered thus, aesthetically perfect, to large wildcat size. Cut off its ears and tail. Xenotransplant it onto the girl. Put her on lifelong immunosuppressive medications to ensure the transplant isn't rejected. Well done, you degenerate. You've crossed several moral, ethical and legal boundaries. You are no longer welcome in any Kingdom of Man nor God. But hey. At least you have a catgirl.", "author": "denki"}, "portals": {"41,24": {}, "38,18": {"cooldown": 1000, "destination": {"y": 24, "x": 41}}, "35,21": {"cooldown": 1000, "destination": {"y": 24, "x": 41}}, "10,12": {"cooldown": 1000, "destination": {"y": 6, "x": 7}}, "7,6": {}, "13,9": {"cooldown": 1000, "destination": {"y": 6, "x": 7}}}, "fields": {}, "switches": {"21,27": {"toggle": [{"pos": {"y": 28, "x": 24}}, {"pos": {"y": 27, "x": 25}}, {"pos": {"y": 26, "x": 26}}], "timer": 0}, "27,3": {"toggle": [{"pos": {"y": 2, "x": 24}}, {"pos": {"y": 3, "x": 23}}, {"pos": {"y": 4, "x": 22}}], "timer": 0}}, "marsballs": [], "spawnPoints": {"blue": [], "red": []}}